w6d4/art-share-part-2/app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            user = User.find(params[:user_id])
            comments = user.comments
        elsif params[:artwork_id]
            artwork = Artwork.find(params[:artwork_id])
            comments = artwork.comments
        else
            comments = Comment.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "comment20"], ["user_id", 2], ["artwork_id", 5], ["created_at", "2022-02-04 01:29:14.641340"], ["updated_at", "2022-02-04 01:29:14.641340"]]

    def destroy
        comment = Comment.find(params[:id])
        if comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 17]]