weeks/w6/w6d3/peter_kim_art_share/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 10], ["viewer_id", 6], ["created_at", "2022-02-03 22:28:44.545911"], ["updated_at", "2022-02-03 22:28:44.545911"]]
---
    def create
        shared = ArtworkShare.new(artwork_share_params)
        if shared.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 18]]
---
    def destroy
        shared = ArtworkShare.find(params[:id])
        if shared.destroy